In [2]:
import pandas as pd 
pd.Series([7,3,5,8])

0    7
1    3
2    5
3    8
dtype: int64

In [8]:
x=pd.Series([7,3,5,8], index=['서울','대구','부산','광주'])
print(x)
x[['서울','대구']]
x.index
x.values
print(sorted(x.index))
print(sorted(x.values))

x = x.reindex(sorted(x.index))
x

서울    7
대구    3
부산    5
광주    8
dtype: int64
['광주', '대구', '부산', '서울']
[3, 5, 7, 8]

광주    8
대구    3
부산    5
서울    7
dtype: int64

In [9]:
x = pd.Series([3,5,8,9], index =['서울', '대구', '부산', '광주'])
y = pd.Series([10,10,10,10], index =['대구', '부산', '서울', '대전'])
x + y

광주     NaN
대구    15.0
대전     NaN
부산    18.0
서울    13.0
dtype: float64

In [10]:
medal = [1,3,2,4,2,3]
x = pd.Series(medal)
print(pd.unique(x))

[1 3 2 4]

In [11]:
age = {'민준':23, '현우':43, '서연':12, '동현':45}
x = pd.Series(age)
x

민준    23
현우    43
서연    12
동현    45
dtype: int64

In [15]:
names = ['민준', '서연','현우', '민서', '동현', '수빈']
pdata = pd.Series(names)
print(pdata)

a = pdata[3:6]
# print(a[2])
print(a[5])

0    민준
1    서연
2    현우
3    민서
4    동현
5    수빈
dtype: object
수빈

In [22]:
data = {
    'age':[23,43,12,45],
    'name':['민준', '서연','현우', '민서'],
    'height':[175.3, 180.3, 165.8, 172.7]
}

x = pd.DataFrame(data, columns =['name', 'age', 'height'])

x.name
x.height

0    175.3
1    180.3
2    165.8
3    172.7
Name: height, dtype: float64

In [19]:
ary = [[1,2], [3,4], [5,6]] 
data = pd.DataFrame(ary, columns = ['first','second'])
data

   first  second
0      1       2
1      3       4
2      5       6

In [21]:
data.iloc[1]
data.iloc[:, -1]

0    2
1    4
2    6
Name: second, dtype: int64

In [28]:
array = [[1,2], [3,4], [5,6], [7,8], [9,10]]
data = pd.DataFrame(ary, columns =['First','Second'])
data.head(3)

   First  Second
0      1       2
1      3       4
2      5       6

In [29]:
ary = [[1,2], [3,4], [5,6], [7,8], [9,10]]
data = pd.DataFrame(ary, columns = ['First', 'Second'])
bools = [False, True, True, False, True]
data.Second[bools]

1     4
2     6
4    10
Name: Second, dtype: int64

In [30]:
data = {
    'age':[23,43,12,45],
    'name':['민준', '서연','현우', '민서'],
    'height':[175.3, 180.3, 165.8, 172.7]
}

x = pd.DataFrame(data, columns =['name', 'age', 'height'])

print(x.mean())

age        30.750
height    173.525
dtype: float64

C:\Users\보람!\AppData\Local\Temp/ipykernel_14872/2132887366.py:9: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  print(x.mean())

In [31]:
data = {
    'age':[23,43,12,45],
    'name':['민준', '서연','현우', '민서'],
    'height':[175.3, 180.3, 165.8, 172.7]
}

x = pd.DataFrame(data, columns =['name', 'age', 'height'])
index = [True,False,True,False]
print(x[index])

  name  age  height
0   민준   23   175.3
2   현우   12   165.8

In [37]:
import pandas as pd
food = pd.read_csv('food.csv', encoding='cp949')
food.head()

    구분     국가         시작일         종료일   성격   비고
0  단독형  말레이시아  2021-06-29  2021-06-29  B2B  온라인
1  단독형     태국  2021-07-29  2021-07-30  B2B  온라인
2  단독형    프랑스  2021-09-09  2021-09-10  B2B  온라인
3  단독형     호주  2021-07-14  2021-07-15  B2B  온라인
4  연계형    베트남  2021-11-04  2021-11-05  B2B  온라인